Revit 2024 API
ProjectLocation.GetSiteLocation Method
 Gets the site location to which this project location refers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public SiteLocation GetSiteLocation()
Visual Basic
Public Function GetSiteLocation As SiteLocation
Visual C++
public:
SiteLocation^ GetSiteLocation()
Remarks
 The site location object contains the longitude, latitude, and time-zone of the entire project site.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace